local GameTxtCfg = {
    roleName = {
        [1] = {
            name = "查尔斯",
            job = "弓箭手",
            sex = 1,
            age = 26,
            attack = "查尔斯娴熟的飞矢技巧可以精准命中任何一个敌人，还可以学习到箭矢荼毒、穿透的能力。",
            superSkill = "查尔斯的多重箭矢可以在瞬间向扇形方向射出无数只箭雨，敌人靠近时效果最佳。",
            introduce = "在这片怪物肆虐，充满混沌的大陆上，一位不知来自何方的勇士，勇敢得站了出来。身怀净化世界远大志向，踏上了远征之路。没有人了解他来自何方，只知道这位勇士有着无比正义魅力，愿意跟随他的脚步，彼此帮助，共度难关。",
            person = {
                [1] = "每箭伤害：",
                [2] = "箭支数量：",
                [3] = "穿透率 ：",
                [4] = "中毒伤害 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 0,
                [3] = 1
            },
            talk = {
                [1] = "我来自神圣国度,我的气质如同我的弓一样犀利.",
                [2] = "hey!What's wrong with you?",
                [3] = "Are you kidding?",
                [4] = "你是垦丁?",
                [5] = "箭无虚发听说过吗？没错，就是我",
                [6] = "我们玩个蒙眼射苹果的游戏吧，嗯 你先拿苹果。"
            }
        },
        [2] = {
            name = "安德烈",
            job = "炮手",
            sex = 1,
            age = 41,
            attack = "安德烈的重炮虽然笨重，但是大范围的炮弹溅射可以令成群的敌人闻风丧胆，可拥有炮弹二次溅射伤害的能力。",
            superSkill = "安德烈可以向目标区域进行无差别多轮轰炸，对密集排列的敌人造成致命伤害。",
            introduce = "在西伯利亚得边缘，有个被遗忘得小村庄叫做莫纳摩尔。少年安德烈与他祖父一起，在这个村庄里等待他的叔叔归来。安德烈的叔叔本该按时来给他们补给食物，但是叔叔在从村庄回家的路上发生了意外，迷失在了“冻土大陆”",
            person = {
                [1] = "炮弹伤害：",
                [2] = "伤害范围：",
                [3] = "眩晕时间 ：",
                [4] = "攻击范围 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 1,
                [3] = 0
            },
            talk = {
                [1] = "我很擅长治疗火力不足恐惧症~嘿嘿",
                [2] = "乌拉!乌拉!乌拉!",
                [3] = "炮弹要装子母弹才够味",
                [4] = "Давно тебя!",
                [5] = "嘿~伙计!我感觉你需要一些帮助.",
                [6] = "我很擅长治疗火力不足恐惧症~嘿嘿"
            }
        },
        [3] = {
            name = "阿维利亚",
            job = "狙击手",
            sex = 0,
            age = "**",
            attack = "阿维利亚的狙击枪可以对同一位置的多个敌人造成高额伤害，可以学习到造成爆头伤害的会心一击能力。",
            superSkill = "阿维利亚的暗杀狙击可对小范围区域造成多轮精准射击，敌人越少对单体威胁越大。",
            introduce = "住在伊比萨小岛上，用猎枪狩猎为生。某天，小镇来的指挥官发现阿维利亚的射击天分，鼓励她前往皇家军事学院深造，她和年轻的学员们住在一起，恋上了沙漠来的少年萨伊。阿维利亚和萨伊分享着彼此的故事，但两人的命运却从此走向两个迥异的方向。",
            person = {
                [1] = "伤害：",
                [2] = "锁定数量：",
                [3] = "会心伤害 ：",
                [4] = "会心率 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 0,
                [3] = 1
            },
            talk = {
                [1] = "朋友来了有酒喝,怪物来了biu~biu~biu~",
                [2] = "哪个倒霉蛋儿吃我这一发呢?",
                [3] = "No,I'm serious.",
                [4] = "我最喜欢一狙双雕了,nice!",
                [5] = "嘘，别出声，我从不和挂掉的人说话！",
                [6] = "嘘，别出声，我从不和挂掉的人说话！"
            }
        },
        [4] = {
            name = "戴维斯",
            job = "喷火兵",
            sex = 1,
            age = 32,
            attack = "戴维斯操纵火焰喷射的方式毫无技巧可言，因为喷射器可以轻松对一片扇形区域敌人造成伤害，同时拥有点燃敌人的能力。",
            superSkill = "戴维斯可以聚集全部能量对一条直线的敌人进行烈焰炙烤。持续的伤害能对敌人造成极大威胁",
            introduce = "戴维斯是米国安妮特人移民的第一代后裔。从小他就精力旺盛，加入火蝠训练营让他远离了街头的打打杀杀，驭火天赋让他突破了一些纪录，但更惊人的是，他入选了米国远征队，去参加了“灰烬城堡”的远征作战。",
            person = {
                [1] = "每秒伤害：",
                [2] = "持续时间：",
                [3] = "范围 ：",
                [4] = "灼烧伤害 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 0,
                [3] = 0
            },
            talk = {
                [1] = "在我开火之前,你们最好先拨打119.",
                [2] = "嘿~伙计!我感觉你需要一些帮助.",
                [3] = "how about eating out?",
                [4] = "你能不能让设计者给我加点射程",
                [5] = "在我开火之前,你们最好先拨打119.",
                [6] = "BBQ什么的不是家常便饭吗？"
            }
        },
        [5] = {
            name = "佐和子",
            job = "忍者",
            sex = 0,
            age = 19,
            attack = "佐和子可以利用极致的忍术能力聚集于手中的飞刃，能在敌人之间进行弹射(6次)伤害，同时拥有几率秒杀敌人(30%以下血量)的能力。",
            superSkill = "佐和子天赋异禀般的操控多个致命飞刃，飞刃彷佛能自动追踪一样游刃有余的击杀敌人。",
            introduce = "佐和子对忍术充满热情，在甲贺村忍术屋训练忍术，虽然容貌很瑞丽，但因为笨拙大咧的性格而被称为“浪费可爱”，对恋爱很迟钝。佐和子对忍术种暗器的使用很有天赋，一心想挑战伊贺村“千手观音”。",
            person = {
                [1] = "伤害：",
                [2] = "数量：",
                [3] = "弹射增伤 ：",
                [4] = "斩杀概率 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 0,
                [3] = 0
            },
            talk = {
                [1] = "当心点,我的飞镖可是会碰瓷哒!",
                [2] = "我这个飞镖它又大又圆!",
                [3] = "ヤバい",
                [4] = "为什么没有只有两个怪物的关卡呢(泄气)",
                [5] = "心如止水，方能做到自然平衡",
                [6] = "平衡存乎万物之间"
            }
        },
        [6] = {
            name = "娜蕊",
            job = "荆棘巫女",
            sex = 0,
            age = "**",
            attack = "从一侧向另外一侧发出密集突刺，造成范围伤害，同时眩晕目标",
            superSkill = "纳蕊的神秘奥义总是令敌人猝不及防，飞舞的藤曼可以令地面及地下的敌人眩晕并受到大量伤害(BOSS无效)",
            introduce = "纳蕊诞生于一次生物实验灾难，使她获得了实体形态的自然之怒，是拥有诱惑外观的植物与人类的混合体。她战斗的真正目的无知晓，只是总会听她喃喃自语",
            person = {
                [1] = "地刺伤害：",
                [2] = "眩晕时间：",
                [3] = "地刺数量 ：",
                [4] = "重伤伤害 ："
            },
            canTarget = {
                [1] = 1,
                [2] = 1,
                [3] = 0
            },
            talk = {
                [1] = "地底下潜藏着一些东西",
                [2] = "森林里有许多惊的喜",
                [3] = "你的朋友在哪里？我的朋友遍布四周",
                [4] = "这片土地是我的",
                [5] = "看着我的眼睛说，觉得我美吗？",
                [6] = "只有'鞭挞'世界，世界才能维持运转"
            }
        }
    },
    equipName = {
        [1] = {
            [1] = "弓箭",
            [2] = "肩甲",
            [3] = "皇冠",
            [4] = "这具名为“落日之辉”的弓箭历史早已源远流长，它本身不仅可以退魔御敌，更是光明与正义的信仰圣物。它可以穿透多个敌人",
            [5] = "“钢铁之肩”确切来讲它是一件披风，但在每每遇到紧要关头都能护住主人的周全；的确称得上钢铁一般的肩甲。有了它攻速更上一层楼",
            [6] = "要不是看到他头戴的这个护具头冠，很难联想到平易近人的查尔斯是个王公贵族；这件祖传神器可以带来毒素攻击伤害"
        },
        [2] = {
            [1] = "大炮",
            [2] = "背带",
            [3] = "火把",
            [4] = "看似复古的“小胖子”轰天炮虽然造型老旧，但它独有的内部结构可以发射分裂炮弹，这往往打的敌人措手不及",
            [5] = "简约而朴实的十字背带，透露出安德烈浓郁的做事风格-粗暴但有效；有了它信心与攻速都是成倍增加",
            [6] = "没有一个趁手得点火装置，在厉害的炮筒也会哑火，鎏金火把有效提升了轰炸范围"
        },
        [3] = {
            [1] = "狙击枪",
            [2] = "战术背心",
            [3] = "瞄具",
            [4] = "“巨龙吐息”作为最新科技的全息系列装备可以精准命中任何瞄准得敌人，它能提供高额得会心伤害",
            [5] = "不要小看这个战术背心，同样是全息系列装备的它可以激励使用者提升高额攻速",
            [6] = "迷你瞄具可以在战场中快速提供战辅助数据，更可以在扣动扳机的时候提升会心几率"
        },
        [4] = {
            [1] = "喷火枪",
            [2] = "护甲",
            [3] = "燃料罐",
            [4] = "只有真正的勇士才能驾驭“毁灭者”喷射器，它那加长的枪管可以提升喷射范围",
            [5] = "“火蝠”动力装甲不仅能有效保护主人，更提供了强力信心从而更快的进行攻击",
            [6] = "经过戴维斯悉心研究出的特殊燃料罐可以在喷射火焰瞬间加压，浓缩的燃料可以持续灼烧敌人"
        },
        [5] = {
            [1] = "飞镖",
            [2] = "披风",
            [3] = "护腕",
            [4] = "“风魔手里剑”在敌人之间的每一次折返都会逐渐提升伤害，这也是它独有的攻击效果",
            [5] = "佐和子的这件披风如同忍者一样，总是若隐若现，但依然不能小觑它能带来的高额攻速加成",
            [6] = "名为“忍”的这具护手无时无刻都在提醒着主人忍道的意义，当在御敌的时候更可带来几率秒杀敌人效果"
        },
        [6] = {
            [1] = "法杖",
            [2] = "长袍",
            [3] = "耳机",
            [4] = "“大地之杖”可以聚集地之灵气，可以为使用者增加更多地刺",
            [5] = "“森之法袍”充满了自然的灵气，它能振奋主人从而更快的进行攻击",
            [6] = "“地之护手”似乎被赋予了超强的自然之力，在进行攻击的同时可以令敌人持续流血伤害"
        }
    },
    equipType = {
        [1] = "武器",
        [2] = "装备",
        [3] = "配件"
    },
    attributeType = {
        [0] = "未知属性",
        [1] = "攻击",
        [2] = "攻击速度",
        [3] = "暴击率",
        [4] = "暴击伤害",
        [5] = "攻击",
        [6] = "攻速",
        [7] = "暴击伤害",
        [8] = "穿透率",
        [9] = "中毒伤害",
        [10] = "眩晕时间",
        [11] = "范围",
        [12] = "会心伤害",
        [13] = "会心率",
        [14] = "喷火范围",
        [15] = "灼烧伤害",
        [16] = "弹射增伤",
        [17] = "斩杀概率",
        [18] = "藤曼数量",
        [19] = "重伤伤害",
        undefined = "未知属性"
    },
    attributeIntroduct = {
        [1] = "对敌人造成的基础伤害值",
        [2] = "进行攻击的频率",
        [3] = "触发暴击的概率",
        [4] = "暴击后造成基础伤害的倍率",
        [5] = "额外增加的攻击比例",
        [6] = "额外增加的攻速比例",
        [7] = "额外增加的暴击伤害比例",
        [8] = "穿透一名敌人的概率，可多次穿透",
        [9] = "对敌人施加持续6秒，每秒4次的毒液伤害",
        [10] = "令敌人无法行动的时间",
        [11] = "攻击后进行溅射的子炮弹大小",
        [12] = "造成会心一击后造成基础伤害的倍率",
        [13] = "触发会心一击的概率",
        [14] = "攻击范围长度",
        [15] = "对敌人施加持续3秒，每秒5次的燃烧伤害",
        [16] = "连续攻击多个敌人时，增加伤害加成比例",
        [17] = "对血量低于30%以下的敌人进行秒杀的概率",
        [18] = "攻击时产生的藤曼数量",
        [19] = "对敌人施加持续6秒，每秒4次的流血伤害"
    },
    segment = {
        [0] = "预备役",
        [1] = "列兵",
        [2] = "一等兵",
        [3] = "二等兵",
        [4] = "下士",
        [5] = "中士",
        [6] = "上士",
        [7] = "少尉",
        [8] = "中尉",
        [9] = "上尉",
        [10] = "少校"
    },
    specialSkill = {
        [1] = {
            Name = "万箭齐发",
            Des = "对扇形区域施放多重箭雨               ",
            Des2 = "伤害：",
            Des3 = "箭数：",
            Des4 = "对扇形区域施放多重箭雨"
        },
        [2] = {
            Name = "集束炸弹",
            Des = "对目标区域进行密集轰炸               ",
            Des2 = "炮弹伤害：",
            Des3 = "轰炸范围：",
            Des4 = "对目标区域进行密集轰炸"
        },
        [3] = {
            Name = "让子弹飞",
            Des = "对小范围敌人进行定点清除            ",
            Des2 = "伤害：",
            Des3 = "攻击人次：",
            Des4 = "对小范围敌人进行定点清除"
        },
        [4] = {
            Name = "烈焰倾泻",
            Des = "对一条直线内敌人造成巨额伤害   ",
            Des2 = "每秒伤害：",
            Des3 = "持续时间：",
            Des4 = "对一条直线内敌人造成巨额伤害"
        },
        [5] = {
            Name = "刺客信条",
            Des = "一次投掷多个飞镖进行弹射攻击   ",
            Des2 = "伤害：",
            Des3 = "飞镖个数：",
            Des4 = "一次投掷多个飞镖进行弹射攻击"
        },
        [6] = {
            Name = "女神之怒",
            Des = "对圆形区域逐步造成伤害，造成范围伤害，同时眩晕目标     ",
            Des2 = "伤害：",
            Des3 = "眩晕时间：",
            Des4 = "对圆形区域逐步造成伤害，造成范围伤害，同时眩晕目标"
        }
    },
    dailyTaskContent = {
        [1] = "完成每日任务",
        [2] = "累计杀敌",
        [3] = "累计英雄升级",
        [4] = "累计超级技能次数",
        [5] = "累计播放视频",
        [6] = "累计开启宝箱",
        [7] = "累计合成装备",
        [8] = "提升战力",
        [9] = "累计获得装备",
        [10] = "累计获得碎片",
        [11] = "累计分享",
        [12] = "击杀蟒蛇怪",
        [13] = "击杀巨石怪",
        [14] = "击杀复苏兵",
        [15] = "击杀树妖",
        [16] = "击杀巨蝎精",
        [17] = "击杀育母蜘蛛",
        [18] = "击杀巨蟹将",
        [19] = "击杀木乃伊",
        [20] = "击杀跳跳先生",
        [21] = "击杀幽灵南瓜",
        [22] = "击杀水元素",
        [23] = "击杀憎恶",
        [24] = "击杀无畏者",
        [25] = "击杀陆行鲨",
        [26] = "击杀迅捷鼠",
        [27] = "击杀飞艇",
        [28] = "击杀飞蚊"
    },
    equipQualityColor = {
        [1] = {
            255,
            255,
            255
        },
        [2] = {
            126,
            255,
            126
        },
        [3] = {
            0,
            255,
            0
        },
        [4] = {
            0,
            255,
            240
        },
        [5] = {
            0,
            209,
            255
        },
        [6] = {
            0,
            178,
            255
        },
        [7] = {
            199,
            165,
            255
        },
        [8] = {
            184,
            141,
            255
        },
        [9] = {
            155,
            95,
            255
        },
        [10] = {
            255,
            175,
            95
        }
    },
    shareMessageTitle = {
        [1] = "满屏大招也太爽了吧。",
        [2] = "快来帮我，我快顶不住了！",
        [3] = "这个游戏太难了。快来帮帮我。"
    },
    petName = {
        [1] = "球球",
        [2] = "斯帕克",
        [3] = "花花",
        [4] = "咕咕",
        [5] = "赫祖娜特",
        [6] = "龙",
        [7] = "阿呆",
        [8] = "泡泡",
        [9] = "卡尔",
        [10] = "毛毛"
    },
    petStageDes = {
        [1] = "幼年体",
        [2] = "成长体",
        [3] = "成熟体",
        [4] = "完全体",
        [5] = "完美体",
        [6] = "聚合体",
        [7] = "究极体",
        [8] = "超究极体"
    },
    petDetail = {
        [1] = {
            [1] = "使用灵活但高素质的身体去坐垮周围的敌人，并对他们造成范围伤害(主动寻找最近的敌人)",
            [2] = "<outline color=black width=2>将范围内敌人进行灵魂链接，攻击其中任何一个，其他怪物也将受到牵连并造成攻击力<color=#00ff00>{2}</c>%的伤害(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [2] = {
            [1] = "使用充满熊熊烈焰的热情之心来感化敌人，对周围进行灼烧伤害(随机移动)",
            [2] = "<outline color=black width=2>散发出9个火焰之种到敌人身上，当他们死亡时将会爆炸并对周围造成自身<color=#00ff00>{2}</c>%血量的伤害(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [3] = {
            [1] = "依靠充满魅力的魔法气息来吸引最近的敌人走向自己，并造成伤害(随机移动)",
            [2] = "<outline color=black width=2>瞬间魅惑周围所有敌人，使他们情不自禁的像自己靠拢，持续<color=#00ff00>{2}</c>秒(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [4] = {
            [1] = "每当听到“咕咕哒”的啼鸣，必定会有敌人因为靠近炸蛋而受到伤害(随机移动)",
            [2] = "<outline color=black width=2>孵出巨型炸蛋，当有敌人触碰时引爆周围地区，造成敌人当前血量<color=#00ff00>{2}</c>的伤害(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [5] = {
            [1] = "依附在战场两侧的孪生兄妹，彼此默契的向中央进行攻击(跟随最下方怪移动)",
            [2] = "<outline color=black width=2>在他们之间会产生一条坚固无比的藤条阻碍敌人们的行进，持续<color=#00ff00>{2}</c>秒(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [6] = {
            [1] = "在暗藏杀机的地下，游龙随时会浮出地面撕咬多个敌人(随机移动)",
            [2] = "<outline color=black width=2>当进行攻击时，由于巨大的惯性往往使<color=#00ff00>{2}</c>圆形范围内的敌人被抛向最远处(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [7] = {
            [1] = "毫无感情的向单个敌人发起快速法术攻击(随机移动)",
            [2] = "<outline color=black width=2>对周围敌人进行永久性的诅咒标记，对他们进行攻击时可以造成额外<color=#00ff00>{2}</c>%的增伤效果从而轻松击杀他们(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [8] = {
            [1] = "释放法术球进行单体攻击，超长的攻击距离是一大优势(战场最下方左右移动)",
            [2] = "<outline color=black width=2>祝福周围的伙伴勇士们，使他们接下来的时间内普攻翻倍,持续<color=#00ff00>{2}</c>秒(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [9] = {
            [1] = "一锤80童叟无欺，可以击退敌人的同时造成范围伤害(战场最下方左右移动)",
            [2] = "<outline color=black width=2>对我方城墙进行血量恢复。每2秒恢复1次共计可修复<color=#00ff00>{2}</c>单位血量(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        },
        [10] = {
            [1] = "每次攻击发出的闪电链可以进行最多3次连锁攻击(只会在战场最下方左右移动)",
            [2] = "<outline color=black width=2>为一位我方伙伴中大招能量最低的勇士迅速补充<color=#00ff00>{2}</c>能量点数(技能CD=<color=#00ff00>{1}</c>S)</outline>"
        }
    },
    petFrom = {
        [1] = "每日任务",
        [2] = "宠物洞穴",
        [3] = "累计视频",
        [4] = "孵蛋",
        [5] = "宠物洞穴",
        [6] = "孵蛋",
        [7] = "里程碑",
        [8] = "宠物洞穴",
        [9] = "宠物洞穴",
        [10] = "宠物洞穴"
    }
}

return GameTxtCfg