export enum TaskItem{
    // 日常任务
    升级1次英雄=11001,//1
    升星1次英雄=12001,//1
    升级1次装备=13001,
    升级1次装备品级=14001,//3
    升级1次宠物=15001,//1
    升级1次专武=16001,//1
    挑战1次关卡=21001,//2
    挑战1次无尽挑战=22001,//2
    挑战1次BOSS狩猎=23001,//2
    挑战1次爬塔=24001,//2
    挑战1次冰河探险=25001,//2
    挑战3次关卡=21002,//2
    挑战3次无尽挑战=22002,//2
    挑战3次BOSS狩猎=23002,//2
    挑战3次爬塔=24002,//2
    进行1次开启装备=31001,//1
    进行10次开启装备=31002,//1
    进行1次宠物招募=32001,//1
    进行10次宠物孵化=32002,//1
    进行1次英雄招募=33001,//1
    进行10次英雄招募=33002,//1
    商店中购买物品1次=34001,//1
    购买1次商店中的金币=35001,//1
    登录游戏1次=41001,//1
    领取挂机奖励2次=42001,//1
    领取快速挂机1次=43001,//1
    观看任意1次广告=44001,//1
    观看任意3次广告 = 44002,//1

    转动转盘1次 = 45001,//1

    // 主线任务
    通关X = 10000001,//3
    释放X次人物技能 = 20000001,
    上阵X名英雄 = 30000001,//3
    招募X次英雄 = 40000001,//1
    将任意X名英雄升到10级 = 50000001,//1
    为任意X名英雄穿戴1件装备 = 60000001,//3
    将炮手升至1大星 = 70000001,//1
    完成X次每日任务 = 80000001,//1
    完成X次成就任务 = 90000001,//1
    前往商城购买X次商品 = 100000001,//1
    前往商城孵化X次宠物 = 110000001,
    合成X次装备 = 120000001,//3
    登录X次游戏 = 130000001,//1

    转盘X次 = 140000001,//1
    升级X次灵宠 = 150000001,//1

    挑战X次无尽挑战 = 160000001,//1
    挑战X次boss狩猎 = 170000001,//1
    进行账号绑定 = 180000001,


    // 成就任务
    累计通过X关 = 100001,//3
    累计1个英雄升到X级 = 200001,//1
    累计收集X个英雄 = 300001,//1
    累计1个英雄升到X星 = 400001,//1
    累计获得X件装备 = 500001,//1
    累计X件装备到达品质6 = 600001,//3
    累计招募X个英雄 = 700001,//1

    通过第X章 = 800001,//1
    累计登录X天 = 900001,//1
    累计孵化灵宠蛋X次 = 1000001,//1
    累计将X只宠物升至最高品质 = 1100001,//1

    无尽挑战分数到达X波次 = 1200001,
    boss狩猎分数到达X伤害 = 1300001,
    虚空探险通过第X章 = 1400002,

}

export enum TaskState{
    Ongoing = 0,
    Completed,
    Received,
}